app/Http/Controllers/Propriedade/Crud.php

select * from `propriedade` where `id_propriedade` = '1' and `id_usuario` = 1 limit 1
---
    public function show($id)
    {
        $propriedade = PropriedadeModel::where('id_propriedade', $id)
            ->where('id_usuario', Auth::id())
            ->firstOrFail();