app/Http/Controllers/Propriedade/Tela.php

    public function telaAlterar($id)
    {
        $propriedade = PropriedadeModel::where('id_propriedade', $id)
                                  ->where('id_usuario', Auth::id())
                                  ->firstOrFail();
---
select * from `propriedade` where `id_propriedade` = '1' and `id_usuario` = 1 limit 1