app/Http/Controllers/Controller.php

    public function index(Request $request)
    {
        if (!isset($this->model) || !isset($this->resourceName)) {
            abort(404, 'Método index não implementado para este controller.');
        }

        if (method_exists($this->model, 'propriedade')) {
            $data = $this->model::whereHas('propriedade', function ($query) {
                $query->where('id_usuario', Auth::id());
            })->get();
        } else {
            // Caso contrário, retorna todos os registros do usuário
            $data = $this->model::where('id_usuario', Auth::id())->get();
---
select * from `propriedade` where `id_usuario` = 1