app/Models/Propriedade.php

select count(*) as aggregate from `lavoura` where `id_propriedade` = 1
---
    public function getDetalhesFormatados()
    {
        $detalhes = [];

        $detalhes['id'] = $this->id_propriedade;
        $detalhes['nome'] = $this->ds_nome;
        $detalhes['tp_solo'] = $this->tp_solo ? $this->tp_solo->label() : 'Não informado';
        $detalhes['area_hectares'] = $this->nu_area_hectares ? number_format($this->nu_area_hectares, 2, ',', '.').' ha' : 'Não informada';
        $detalhes['localizacao'] = $this->ds_localizacao ?? 'Não informada';
        $detalhes['proprietario'] = UsuarioEntity::getNomeUsuarioById($this->id_usuario) ?? 'Não informado';
        $detalhes['total_lavouras'] = LavouraEntity::getLavourasByPropriedade(Lavoura::query(), $this->id_propriedade)->count();